Revit 2027 API
BoundingBoxXYZ.Transform Property
The transform from the coordinate space of the box to the model coordinate space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
public:
property Transform^ Transform {
	Transform^ get ();
	void set (Transform^ value);
}
member Transform : Transform with get, set
Property Value
Transform
Remarks
The transform must always be right-handed and orthonormal.
Example
private void RotateBoundingBox(View3D view3d)
{
    if (!view3d.IsSectionBoxActive)
    {
        TaskDialog.Show("Revit","The section box for View3D isn't active.");
        return;
    }
    BoundingBoxXYZ box = view3d.GetSectionBox();
    // Create a rotation transform to apply to the section box
    XYZ origin = new XYZ(0, 0, 0);
    XYZ axis = new XYZ(0, 0, 1);
    // Rotate 30 degrees
    Transform rotate = Transform.CreateRotationAtPoint(axis, Math.PI/6.0, origin);
    // Transform the View3D's section box with the rotation transform
    box.Transform = box.Transform.Multiply(rotate);
    // Set the section box back to the view (requires an open transaction)
    view3d.SetSectionBox(box);
}
See Also
Reference
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace